LonelyWolf/stm32/bike-computer/GUI.c
	// Find maximal and minimal values
	min = data[0]; max = data[0];
	for (i = 0; i < W; i++) {
		if (data[i] < min) min = data[i];
		if (data[i] > max) max = data[i];
	}
	// Scale ratio
	mY = (H - 1) / (float)(max - min);
	if (mY > H / 10) {
		mY = H / 10;
		offset = (H / 2) - ((max - min) * mY / 2);
	} else offset = 0;
	// Bottom line of the graph
	bY = Y + H - 1;

	// Draw graph
	if (GraphType == GT_dot) {
		// Dots
		for(i = 0; i < W; i++) SetPixel(X + i,bY - (uint16_t)((data[i] - min) * mY) - offset);
	} else if (GraphType == GT_line) {
		// Continuous line
		pY = bY - (uint16_t)((data[0] - min) * mY) - offset;
		for(i = 1; i < W; i++) {
			YY = bY - (uint16_t)((data[i] - min) * mY) - offset;
			Line(X + i - 1,pY,X + i,YY);
			pY = YY;
		}
	} else {
		// Filled graph
		for(i = 0; i < W; i++) VLine(X + i,bY - (uint16_t)((data[i] - min) * mY) - offset,bY,PSet);
	}
}

void GUI_DrawGPSInfo(void) {
	uint8_t X,Y;

	UC1701_Fill(0x00);

	X = 0; Y = 0;
	X += GUI_PutTimeSec5x7(X,Y,GPSData.time,CT_opaque) + 5;
	X += GUI_PutDate5x7(X,Y,GPSData.date,CT_opaque);

	X = 0; Y += 8;
	X += PutStr5x7(X,Y,"Fix:",CT_opaque) - 1;
	if (GPSData.fix != 2 && GPSData.fix != 3)
		X += PutStr5x7(X,Y,"NA",CT_opaque) + 5;
	else {
		PutInt5x7(X,Y,GPSData.fix,CT_opaque);
		PutChar5x7(X + 6,Y,'D',CT_opaque);
		X += 17;
	}
	X += PutStr5x7(X,Y,"Qlty:",CT_opaque) - 1;
	PutChar5x7(X,Y,GPSData.fix_quality + '0',CT_opaque);
	X += 11;
	X += PutStr5x7(X,Y,"Mode:",CT_opaque) - 1;
	PutChar5x7(X,Y,GPSData.mode,CT_opaque);

	X = 0; Y += 8;
	GUI_PutCoord5x7(X,Y,GPSData.latitude_degree,GPSData.latitude_seconds,GPSData.latitude_char,CT_opaque);
	X = 63;
	GUI_PutCoord5x7(X,Y,GPSData.longitude_degree,GPSData.longitude_seconds,GPSData.longitude_char,CT_opaque);

	X = 0; Y += 8;
	X += PutStr5x7(X,Y,"Alt:",CT_opaque) - 1;
	X += PutInt5x7(X,Y,GPSData.altitude,CT_opaque) + 5;
	X += PutStr5x7(X,Y,"Spd:",CT_opaque) - 1;
	X += PutIntF5x7(X,Y,GPSData.speed,2,CT_opaque);

	X = 0; Y += 8;
	X += PutStr5x7(X,Y,"Crs:",CT_opaque) - 1;
	X += PutIntF5x7(X,Y,GPSData.course,2,CT_opaque) + 5;
	X += PutStr5x7(X,Y,"Sat:",CT_opaque) - 1;
	X += PutInt5x7(X,Y,GPSData.sats_used,CT_opaque);
	PutChar5x7(X,Y,'/',CT_opaque);
	X += 6;
	X += PutInt5x7(X,Y,GPSData.sats_view,CT_opaque);

	X = 0; Y += 8;
	X += PutStr5x7(X,Y,"PDOP:",CT_opaque) - 1;
	X += PutIntF5x7(X,Y,GPSData.PDOP,2,CT_opaque) + 5;

	X = 0; Y += 8;
	X += PutStr5x7(X,Y,"HDOP:",CT_opaque) - 1;
	X += PutIntF5x7(X,Y,GPSData.HDOP,2,CT_opaque) + 5;
	X += PutStr5x7(X,Y,"VDOP:",CT_opaque) - 1;
	X += PutIntF5x7(X,Y,GPSData.VDOP,2,CT_opaque) + 5;
}

// Put coordinates in format "Ndd.xxxxxx"
//void GUI_PutCoord5x7(uint8_t X, uint8_t Y, uint8_t degree, uint8_t min_i, uint32_t min_f, char ch, CharType_TypeDef CharType) {
uint8_t GUI_PutCoord5x7(uint8_t X, uint8_t Y, uint8_t degree, uint32_t seconds, char ch, CharType_TypeDef CharType) {
	uint8_t pX = X;

	PutChar5x7(X,Y,ch,CharType);
	X += 6;
	X += PutIntF5x7(X,Y,(degree * 1000000) + (seconds / 60),6,CharType);

	return X - pX;
}

// Draw time with standard 5x7 font
// input:
//   X,Y - top left coordinates of text
//   time - time in seconds (max value = 3599999 seconds or 999:59:59)
//   CharType - character drawing style
uint8_t GUI_PutTimeSec5x7(uint8_t X, uint8_t Y, uint32_t time, CharType_TypeDef CharType) {
	uint8_t pX = X;
	uint16_t hours;
	uint8_t minutes,seconds;

	hours   = time / 3600;
	minutes = (time / 60) % 60;
	seconds = time % 60;
	if (hours > 999) {
		hours   = 999;
		minutes = 59;
		seconds = 59;
	}

	if (hours < 10) {
		PutChar5x7(X,Y,'0',CharType);
		X += 6;
	}
	PutInt5x7(X,Y,hours,CharType);
	if (hours > 99) X += 6;
	if (hours > 9)  X += 11; else X += 5;
	PutChar5x7(X,Y,':',CharType);
	X += 4;

	if (minutes < 10) {
		PutChar5x7(X,Y,'0',CharType);
		X += 6;
	}
	PutInt5x7(X,Y,minutes,CharType);
	if (minutes > 9) X += 11; else X += 5;
	PutChar5x7(X,Y,':',CharType);
	X += 4;

	if (seconds < 10) {
		PutChar5x7(X,Y,'0',CharType);
		X += 6;
	}
	X += PutInt5x7(X,Y,seconds,CharType);

	return X - pX;
}

// Draw date with standard 5x7 font
// input:
//   X,Y - top left coordinates of text
//   date - date in format DDMMYYYY
//   CharType - character drawing style
uint8_t GUI_PutDate5x7(uint8_t X, uint8_t Y, uint32_t date, CharType_TypeDef CharType) {
	uint8_t pX = X;
	uint16_t dig;

	// Day
	dig = date / 1000000;
	X += PutIntLZ5x7(X,Y,dig,2,CharType);
	PutChar5x7(X,Y,'.',CharType);
	X += 5;

	// Month
	dig = (date - (dig * 1000000)) / 10000;
	X += PutIntLZ5x7(X,Y,dig,2,CharType);
	PutChar5x7(X,Y,'.',CharType);
	X += 5;

	// Year
	dig = date % 10000;
	X += PutIntLZ5x7(X,Y,dig,4,CharType);

	return X - pX;
}

// Print pressure with 'mmHg'
// input:
//   X,Y - top left coordinates of text
//   pressure - pressure value in Pa
//   PressureType - what units pressure should be displayed (PT_hPa, PT_mmHg)
//   CharType - character drawing style
uint8_t GUI_PutPressure5x7(uint8_t X, uint8_t Y, int32_t pressure, PressureType_TypeDef PressureType,
		CharType_TypeDef CharType) {
	uint8_t pX = X;

	if (PressureType == PT_mmHg) {
		pressure = pressure * 75 / 1000;
		X += PutIntF5x7(X,Y,pressure,1,CharType);
		X += PutStr5x7(X,Y,"mmHg",CharType);
	} else {
		X += PutIntF5x7(X,Y,pressure,2,CharType);
		X += PutStr5x7(X,Y,"hPa",CharType);
	}

	return X - pX;
}

// Print temperature value with Celsius sign
// input:
//   X,Y - top left coordinates of text
//   temperature - temperature value in Celsius degree
//   CharType - character drawing style
uint8_t GUI_PutTemperature5x7(uint8_t X, uint8_t Y, int32_t temperature, CharType_TypeDef CharType) {
	uint8_t pX = X;

	if (temperature < 0) {
		HLine(X,X + 2,Y + 3,PSet);
		temperature *= -1;
		X += 4;
	}
	X += PutInt5x7(X,Y,temperature / 10,CharType);

	// Decimal point
	Rect(X,Y + 5,X + 1,Y + 6,PSet);
	X += 3;

	// Temperature fractional
	X += PutInt5x7(X,Y,temperature % 10,CharType);

	// Celsius degree sign
	HLine(X + 1,X + 2,Y,PSet);
	HLine(X + 1,X + 2,Y + 3,PSet);
	VLine(X,Y + 1,Y + 2,PSet);
	VLine(X + 3,Y + 1,Y + 2,PSet);
	PutChar5x7(X + 5,Y,'C',CharType);

	return X - pX + 10;
}

